{
  "backend/main.mo": "Motoko canister storing contact submissions and network applications with functions to submit, query all, and fetch entries by email.",
  "feature_evidence.json": "Feature evidence report listing two frontend features, their affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend components, pages, and configuration files.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, light/dark mode tokens, and global background/foreground rules.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Sets up the TanStack Router root layout and routes for Home, Services, About, Join Network, and Contact pages.",
  "frontend/src/components/site/DeletionConfirmationDialog.tsx": "Modal dialog enabling selection and confirmation of a deletion target, showing a temporary confirmation state without performing deletion.",
  "frontend/src/components/site/PortfolioPreview.tsx": "Placeholder component returning null to disable the portfolio preview section.",
  "frontend/src/components/site/PrimaryButton.tsx": "Wrapper around shadcn Button providing primary and secondary visual variants with consistent sizing and styling.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with brand text, nationwide messaging, and social links for TikTok, Instagram, and Facebook plus Caffeine attribution.",
  "frontend/src/components/site/SiteHeader.tsx": "Responsive site header with navigation links, mobile menu toggling, and a deletion confirmation dialog trigger.",
  "frontend/src/components/site/SiteLayout.tsx": "Layout wrapper that renders the header, footer, and routed page content.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on the current identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, state, and login/logout behavior.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching contact submissions and network applications using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, global styles, and utility classes.",
  "frontend/src/main.tsx": "App entry point that sets up React Query, Internet Identity provider, and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Static About page describing the company’s vision, systems, and mission using structured content sections.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page that submits inquiries via the backend actor and displays a success message after submission.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, nationwide authority messaging, and service highlights, including CTAs for booking and joining the network.",
  "frontend/src/pages/JoinNetworkPage.tsx": "Implements the join-network application form with submission handling and a success confirmation screen.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a services overview with descriptions, pricing categories, and a hero section emphasizing full-spectrum media production.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme settings, colors, typography, spacing, animations, and plugins for the site.",
  "project_state.json": "Stores project state, including design goals, features, architectural notes, and requirements for the Vertex Media marketing site."
}