{
  "backend/main.mo": "Motoko actor storing contact and network form submissions with methods to submit, list, and fetch entries by email.",
  "feature_evidence.json": "Feature evidence report describing removal of the PortfolioPreview section and listing affected files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Reference file containing prewritten summaries for various frontend components and pages.",
  "frontend/index.css": "Tailwind base styles plus custom CSS variables for light/dark themes and global background/foreground setup.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all main pages using SiteLayout as the root component.",
  "frontend/src/components/site/DeletionConfirmationDialog.tsx": "Dialog allowing users to choose a deletion target and displays a temporary confirmation state without performing deletion.",
  "frontend/src/components/site/PortfolioPreview.tsx": "Component returns null to remove the portfolio section from the UI.",
  "frontend/src/components/site/PrimaryButton.tsx": "Wrapper around shadcn Button providing styled primary and secondary variants.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with brand messaging, nationwide operations text, social links, and Caffeine attribution.",
  "frontend/src/components/site/SiteHeader.tsx": "Sticky header with navigation, mobile menu, and a Delete button that opens the deletion confirmation dialog.",
  "frontend/src/components/site/SiteLayout.tsx": "Wraps pages with header, footer, and main content using React Router's Outlet.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, refetching queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading identities, handling login/logout, and exposing status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch contact submissions and network applications using the backend actor.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, typography styles, and custom utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with sections explaining the company vision, systems, and nationwide structure.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact form that submits data via the backend actor and shows a confirmation on success.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a hero section and feature highlights promoting nationwide media services.",
  "frontend/src/pages/JoinNetworkPage.tsx": "A form page allowing creators to submit a network application via an actor API, with success-state messaging and informational sections about requirements.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a services overview with icons, descriptions, and pricing categories, structured for navigation and client browsing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, typography, color tokens, animations, and plugins.",
  "project_state.json": "JSON metadata describing the project’s state, requirements, design goals, and existing features for the Vertex Media website."
}