{
  "backend/main.mo": "Defines types and in-memory lists for contact submissions and network applications, with APIs to submit, fetch all, and fetch by email.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files for reference or tooling.",
  "frontend/index.css": "Tailwind base layers plus OKLCH variable theme tokens for light and dark mode with global background and border settings.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for Home, Services, About, Join Network, and Contact, wrapped in SiteLayout.",
  "frontend/src/components/site/PortfolioPreview.tsx": "Displays a six-item portfolio grid with grayscale thumbnails and hover-reveal titles and categories.",
  "frontend/src/components/site/PrimaryButton.tsx": "Wrapper around shadcn Button providing custom primary and secondary variants with consistent sizing and typography.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with brand info, nationwide messaging, social links, and Caffeine attribution.",
  "frontend/src/components/site/SiteHeader.tsx": "Sticky header with desktop and mobile navigation using TanStack Router for active link highlighting.",
  "frontend/src/components/site/SiteLayout.tsx": "Layout component rendering SiteHeader, Outlet content, and SiteFooter.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, providing login, logout, and identity persistence via a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks that fetch contact submissions and network applications using the authenticated actor.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes and global typography styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with sections describing the company’s vision, systems, and national presence.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact form that submits inquiries through the backend actor and shows a success message on completion.",
  "frontend/src/pages/HomePage.tsx": "Implements the home page with a hero section, national network overview, and navigation to key actions.",
  "frontend/src/pages/JoinNetworkPage.tsx": "A page that displays a join-the-network application form, handles form state and submission via an actor, and shows a success message after submission.",
  "frontend/src/pages/ServicesPage.tsx": "A services overview page defining six service offerings with icons, descriptions, and features, rendered within a styled layout.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending typography, colors, animations, containers, and theme settings with custom variables and plugins.",
  "project_state.json": "Project metadata describing the marketing site’s goals, design requirements, required assets, and implemented features."
}