{
  "kind": "build_request",
  "title": "Add TikTok, Instagram, and Facebook presence to Vertex Media site (footer + contact)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Update the site footer to indicate Vertex Media is active on TikTok, Instagram, and Facebook by replacing the existing social links/icons with TikTok, Instagram, and Facebook links/icons, and (optionally) adding a short line of text that reads naturally with the existing tone (e.g., “Active on TikTok, Instagram, and Facebook.”).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Edit the existing Vertex Media website content to include that the company is active on TikTok, Instagram, and Facebook.",
          "Add social media icons or mentions in the footer or relevant sections.",
          "Maintain professional, confident, and national brand tone.",
          "Ensure the mention flows naturally and does not disrupt page layout or messaging.",
          "Keep all other content intact (hero, tagline, services, about, network, contact)."
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/components/site/SiteFooter.tsx, the “Connect” section displays TikTok, Instagram, and Facebook icons/links (not LinkedIn/YouTube).",
        "Each social icon link includes an appropriate aria-label and opens in a new tab with rel=\"noopener noreferrer\".",
        "If a textual mention is added, it clearly states Vertex Media is active on TikTok, Instagram, and Facebook and matches the site’s professional, confident tone.",
        "Footer layout spacing and alignment remain consistent with the current design (no wrapping/overlap issues on mobile or desktop)."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Update the Contact page “Connect With Us” section to match the updated social platforms (TikTok, Instagram, Facebook) so the site’s social presence is consistent across relevant sections without changing any other Contact page copy, form fields, or layout structure.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add social media icons or mentions in the footer or relevant sections.",
          "Keep all other content intact (hero, tagline, services, about, network, contact)."
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/pages/ContactPage.tsx, the “Connect With Us” icon row uses TikTok, Instagram, and Facebook icons/links (not LinkedIn/YouTube).",
        "No other Contact page sections (hero copy, nationwide messaging, forms, success state text) are modified beyond the social icons/links.",
        "The updated social icons maintain the existing visual style (size, color, hover behavior) and do not disrupt the page layout."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep all other website content intact outside the social media mentions/icons (do not alter hero, tagline, services, about, join network, or contact content beyond the specified social sections).",
    "Do not add any backend changes for social links; this is a content/UI-only update."
  ],
  "nonGoals": [
    "Adding embedded social feeds, auto-posting, or pulling content from TikTok/Instagram/Facebook APIs.",
    "Implementing social login/authentication.",
    "Changing site navigation, page routing, or other page section copy beyond the requested social presence mention/icons."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}