{
  "kind": "build_request",
  "title": "Remove the Home page “Our Work” portfolio/gallery section",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Remove the “Our Work” / portfolio-gallery section from the Home page by updating only the selected elements that make up the PortfolioPreview section (the section header, subtext, and the portfolio grid/cards) so that the section no longer renders and no empty spacing/gaps remain. Keep all other Home page sections (Hero, tagline, authority section, services overview) intact and unchanged, and ensure the page still flows naturally with consistent headings/spacing and the same authoritative, professional, nationwide tone.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Edit the existing Vertex Media website content to remove the “Our Work” or portfolio/gallery section entirely.",
          "Keep all other content intact",
          "Ensure: The page still flows naturally after removing the section ... No placeholder gaps or empty sections appear",
          "The user instructions should be applied ONLY to the elements selected in this prompt."
        ]
      },
      "acceptanceCriteria": [
        "On the Home page, the “Our Work” heading and its portfolio/gallery grid do not appear anywhere.",
        "No blank/empty section container remains (no extra vertical padding/margins where the portfolio section used to be).",
        "Hero/tagline, authority section, and services overview remain present and unchanged in content and styling.",
        "Site-wide header navigation and footer remain unchanged and visually consistent.",
        "Implementation is limited to updating the PortfolioPreview section’s selected elements only (corresponding to the provided XPaths), without modifying other page sections."
      ]
    }
  ],
  "constraints": [
    "Apply the change ONLY within the user-selected elements for the portfolio/gallery section (provided XPaths). Do not modify other Home page sections or other routes/pages.",
    "Do not edit any files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT.",
    "Do not remove or rename generated static image assets; only remove their usage by the portfolio/gallery section if needed."
  ],
  "nonGoals": [
    "Do not add a new replacement section in place of the portfolio/gallery section.",
    "Do not change copy, layout, or CTAs in the Hero, Authority, Services Overview, About, Join Our Network, or Contact pages/sections.",
    "Do not implement any backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}