{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Vertex Media social presence to TikTok, Instagram, and Facebook (footer + contact)",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Replace footer social links/icons with TikTok, Instagram, and Facebook and optionally add a short social-presence line without affecting layout or other footer content.",
      "acceptanceCriteria": [
        "In frontend/src/components/site/SiteFooter.tsx, the “Connect” section displays TikTok, Instagram, and Facebook icons/links (not LinkedIn/YouTube).",
        "Each social icon link includes an appropriate aria-label and opens in a new tab with rel=\"noopener noreferrer\".",
        "If a textual mention is added, it clearly states Vertex Media is active on TikTok, Instagram, and Facebook and matches the site’s professional, confident tone.",
        "Footer layout spacing and alignment remain consistent with the current design (no wrapping/overlap issues on mobile or desktop)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/site/SiteFooter.tsx",
          "operation": "modify",
          "description": "Update the existing “Connect” social icon row by replacing LinkedIn/YouTube with TikTok and Facebook (keep Instagram), ensuring each link has correct aria-label, target=_blank, and rel=\"noopener noreferrer\". If adding the optional text line (“Active on TikTok, Instagram, and Facebook.” or similar), place it within the Connect section in a way that preserves spacing/alignment and does not disrupt responsive layout. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Update Contact page “Connect With Us” social icons/links to TikTok, Instagram, and Facebook while leaving all other Contact page content and structure unchanged.",
      "acceptanceCriteria": [
        "In frontend/src/pages/ContactPage.tsx, the “Connect With Us” icon row uses TikTok, Instagram, and Facebook icons/links (not LinkedIn/YouTube).",
        "No other Contact page sections (hero copy, nationwide messaging, forms, success state text) are modified beyond the social icons/links.",
        "The updated social icons maintain the existing visual style (size, color, hover behavior) and do not disrupt the page layout."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "In the “Connect With Us” section only, replace the LinkedIn/YouTube icons/links with TikTok and Facebook (keep Instagram), maintaining the same styling classes, icon sizing, hover behavior, and link security attributes (target=_blank with rel=\"noopener noreferrer\" and appropriate aria-labels). Do not alter any other copy, form fields, success-state messaging, or layout structure. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}